T = int(input())
for tc in range(1, T+1):
    N, M, K = map(int, input().split())
    x = N-M
    # 두배이벤트 횟수
    cnt = max(0, ((N//K)-x))
    # B 수열 = 두배이벤트로 벌리는 점수들
    B = [0] * (cnt+1)
    for i in range(1, cnt+1):
        B[i] = (B[i-1]+K)*2
    ans = B[cnt]+(M-cnt*K)
    
    print(f'#{tc} {ans}')



"""
철수는 N개의 문제가 순차적으로 주어지는 면접에서 정확히 M개를 맞췄다.
어떤 문제를 맞췄는지는 기억안나고 M개 맞췄다는거만 기억남
문제 하나 맞추면 1점줌 근데 중요한게
연속으로 문제를 맞추면 더 점수를 많이주는 카운터 시스템이 있는데
예를들어 카운터 값 K가 3이면 3문제 연속으로 맞추면 현재 점수가 2배가됨
카운터의 초기값은 0이고 문제 틀리면 카운터 0으로 초기화됨
N개중에 M개 문제 맞추는 경우 벌 수 있는 점수의 최솟값 구하세용
3<=N<=500
1<=M<=N
2<=K<=N

3
8 7 3
3 3 3
5 2 3

1 2 6 7 8 18


N 최댓값이 500이니깐 재귀로 풀면 아마 못풀거임
후반 갈수록 두배되면 엄청커질꺼니까
후반에 잘틀리는게 중요해보임


k가 정해져있을때 i문제를 다 맞춘다고 가정하면 
1 2 3 ... k-1 2k 2k+1 2k+2 .... 3k-1 6k 6k+1 6k+2 ... 7k-1 14k ...
0 2 6 14 30 62 ...
A[i] = (A[i-1]+1)*2
으로 N문제 전부 맞췄을때 기대 점수를 먼저 구하고 거기서 N-M문제 틀려서 얼마나 망칠수있는지

5 2 3을 예로들면

1 2 6 7 8 이었을건데 원래 // 3문제를 앞으로 더 틀려야하니까 1순위로 일단 k의 자연수배 항들을 항 인덱스가 큰것부터 다 틀려줌 그러면
1 2 2 3 4 가 되고 남은 앞으로 틀려야 할 문제수만큼 최종점수에서 그냥 빼주면됨

벌린 점수를 항으로 두면 더 편할듯?
1 1 1 ... k 1 1 1 ... 3k ... 7k ... 15k
1 3 7 15 31 63 ...
B[i] = B[i-1]+2**i
해서 k와 N에 따른 B수열을 만들어 놨다가 N문제 전부 맞췄을때 기댓값에서 N-M만큼 B수열 pop해가지고 빼면 
답이나올거같음

정답 나오는 식을 만들어봅시다 
다 맞췄다고 가정했을때 원래 두배이벤트 받는 횟수는 N//k번 인데
틀린횟수 x 라고 하면 
두배이벤트 받는 횟수는 N//k - x

일단 M문제는 맞췄으니 


"""
